#pragma once



struct Vector3
{
	float x, y, z;
};

struct vec4
{
	float w, x, y, z;
};

struct vec2
{
	float x, y;
};





class playerent;
class nameptrClass;
class boneptr1class;
class boneptr2class;
class boneptr3class;

class playerent
{
public:
	char pad_0x0000[0x24]; //0x0000
	nameptrClass* nameptr; //0x0024 
	char pad_0x0028[0xC]; //0x0028
	Vector3 coords; //0x0034 
	char pad_0x0040[0x148]; //0x0040
	boneptr1class* boneptr1; //0x0188 
	char pad_0x018C[0x12B0]; //0x018C

}; //Size=0x143C

class nameptrClass
{
public:
	char pad_0x0000[0x88]; //0x0000
	char* name; //0x0088 
	char pad_0x008C[0x3F8]; //0x008C

}; //Size=0x0484


class boneptr1class
{
public:
	char pad_0x0000[0x4]; //0x0000
	boneptr2class* boneptr2; //0x0004 
	char pad_0x0008[0x3FC]; //0x0008

}; //Size=0x0404

class boneptr2class
{
public:
	char pad_0x0000[0xC0]; //0x0000
	boneptr3class* boneptr3; //0x00C0 
	char pad_0x00C4[0x340]; //0x00C4

}; //Size=0x0404

class boneptr3class
{
public:
	char pad_0x0000[0x74]; //0x0000
	char* humanoidvalidation; //0x0074 
	char pad_0x0078[0x58]; //0x0078
	Vector3 b1; //0x00D0 
	char pad_0x00DC[0x6C]; //0x00DC
	Vector3 b2; //0x0148 
	char pad_0x0154[0x6C]; //0x0154
	Vector3 b3; //0x01C0 
	char pad_0x01CC[0x6C]; //0x01CC
	Vector3 b4; //0x0238 
	char pad_0x0244[0x6C]; //0x0244
	Vector3 b5; //0x02B0 
	char pad_0x02BC[0x6C]; //0x02BC
	Vector3 b6; //0x0328 
	char pad_0x0334[0x6C]; //0x0334
	Vector3 b7; //0x03A0 
	char pad_0x03AC[0x6C]; //0x03AC
	Vector3 b8; //0x0418 
	char pad_0x0424[0x6C]; //0x0424
	Vector3 b9; //0x0490 
	char pad_0x049C[0x24C]; //0x049C
	Vector3 b10; //0x06E8 
	char pad_0x06F4[0x6C]; //0x06F4
	Vector3 b11; //0x0760 
	char pad_0x076C[0x6C]; //0x076C
	Vector3 b12; //0x07D8 
	char pad_0x07E4[0x6C]; //0x07E4
	Vector3 b13; //0x0850 
	char pad_0x085C[0x6C]; //0x085C
	Vector3 b14; //0x08C8 
	char pad_0x08D4[0x6C]; //0x08D4
	Vector3 b15; //0x0940 
	char pad_0x094C[0x6C]; //0x094C
	Vector3 b16; //0x09B8 
	char pad_0x09C4[0x6C]; //0x09C4
	Vector3 b17; //0x0A30 
	char pad_0x0A3C[0x6C]; //0x0A3C
	Vector3 b18; //0x0AA8 
	char pad_0x0AB4[0x6C]; //0x0AB4
	Vector3 b19; //0x0B20 
	char pad_0x0B2C[0x6C]; //0x0B2C
	Vector3 b20; //0x0B98 
	char pad_0x0BA4[0x6C]; //0x0BA4
	Vector3 b21; //0x0C10 
	char pad_0x0C1C[0x6C]; //0x0C1C
	Vector3 b22; //0x0C88 
	char pad_0x0C94[0x6C]; //0x0C94
	Vector3 b23; //0x0D00 
	char pad_0x0D0C[0x6C]; //0x0D0C
	Vector3 b24; //0x0D78 
	char pad_0x0D84[0x6C]; //0x0D84
	Vector3 b25; //0x0DF0 
	char pad_0x0DFC[0x6C]; //0x0DFC
	Vector3 b26; //0x0E68 
	char pad_0x0E74[0x6C]; //0x0E74
	Vector3 b27; //0x0EE0 
	char pad_0x0EEC[0x6C]; //0x0EEC
	Vector3 b28; //0x0F58 
	char pad_0x0F64[0x6C]; //0x0F64
	Vector3 b29; //0x0FD0 
	char pad_0x0FDC[0x6C]; //0x0FDC
	Vector3 b30; //0x1048 
	char pad_0x1054[0x6C]; //0x1054
	Vector3 b31; //0x10C0 
	char pad_0x10CC[0x6C]; //0x10CC
	Vector3 b32; //0x1138 
	char pad_0x1144[0x6C]; //0x1144
	Vector3 b33; //0x11B0 
	char pad_0x11BC[0x6C]; //0x11BC
	Vector3 b34; //0x1228 
	char pad_0x1234[0x6C]; //0x1234
	Vector3 b35; //0x12A0 
	char pad_0x12AC[0x6C]; //0x12AC
	Vector3 b36; //0x1318 
	char pad_0x1324[0x6C]; //0x1324
	Vector3 b37; //0x1390 
	char pad_0x139C[0x6C]; //0x139C
	Vector3 b38; //0x1408 
	char pad_0x1414[0x6C]; //0x1414
	Vector3 b39; //0x1480 
	char pad_0x148C[0x6C]; //0x148C
	Vector3 b40; //0x14F8 
	char pad_0x1504[0x74]; //0x1504
	Vector3 b41; //0x1578 
	char pad_0x1584[0xBC]; //0x1584
	Vector3 b42; //0x1640 
	char pad_0x164C[0x6C]; //0x164C
	Vector3 b43; //0x16B8 
	char pad_0x16C4[0x8C]; //0x16C4
	Vector3 b44; //0x1750 
	char pad_0x175C[0x6C]; //0x175C
	Vector3 b45; //0x17C8 
	char pad_0x17D4[0x6C]; //0x17D4
	Vector3 b46; //0x1840 
	char pad_0x184C[0x6C]; //0x184C
	Vector3 b47; //0x18B8 
	char pad_0x18C4[0x15C]; //0x18C4
	Vector3 b48; //0x1A20 
	char pad_0x1A2C[0x6C]; //0x1A2C
	Vector3 b49; //0x1A98 
	char pad_0x1AA4[0x6C]; //0x1AA4
	Vector3 b50; //0x1B10 
	char pad_0x1B1C[0x6C]; //0x1B1C
	Vector3 b51; //0x1B88 
	char pad_0x1B94[0x6C]; //0x1B94
	Vector3 b52; //0x1C00 
	char pad_0x1C0C[0x6C]; //0x1C0C
	Vector3 b53; //0x1C78 
	char pad_0x1C84[0x6C]; //0x1C84
	Vector3 b54; //0x1CF0 
	char pad_0x1CFC[0x6C]; //0x1CFC
	Vector3 b55; //0x1D68 
	char pad_0x1D74[0x6C]; //0x1D74
	Vector3 b56; //0x1DE0 
	char pad_0x3C04[0x68]; //0x3C04

}; //Size=0x3C6C
